integration/src/InformationRegisters/грОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>грОчередьВходящихСообщений</Name>
			<Comment>Очередь входящих сообщений</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпФорматыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.грСистемыИнтеграционногоКонтура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.грВходящиеВнутренниеОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/InformationRegisters/грСостояниеВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>грСостояниеВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпСтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаЧисло</Name>
					<Comment>Содержит сумму даты изменения и задержки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПотока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОткладываний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/Enums/сшпФорматыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>сшпФорматыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FastInfoset</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

integration/src/InformationRegisters/грОчередьВходящихСообщений/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ДатаИзменения = ПолучитьДатуСеанса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ИдентификаторСообщения) тогда
		текЗапрос = Новый Запрос("ВЫБРАТЬ
		                         |	тбСостояние.СтатусСообщения,
		                         |	тбСостояние.ДатаИзменения,
		                         |	тбОчередь.Хранилище
		                         |ИЗ
		                         |	РегистрСведений.грОчередьВходящихСообщений КАК тбОчередь
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.грСостояниеВходящихСообщений КАК тбСостояние
		                         |		ПО тбОчередь.ИдентификаторСообщения = тбСостояние.ИдентификаторСообщения
		                         |ГДЕ
		                         |	тбОчередь.ИдентификаторСообщения = &ИдентификаторСообщения");
								 текЗапрос.УстановитьПараметр("ИдентификаторСообщения", Запись.ИдентификаторСообщения);
								 текВыборка = текЗапрос.Выполнить().Выбрать();
								 текВыборка.Следующий();
				 
		//++ Градум, Фоминский А.С., Задача 22233 , 11.08.2021
		Если Запись.ФорматСообщения = Перечисления.сшпФорматыСообщений.XML Тогда 
			Сообщение = ОтформатироватьXMLСтроку(текВыборка.Хранилище.Получить());
		Иначе	
			Сообщение = текВыборка.Хранилище.Получить();
		КонецЕсли;	
		//-- Градум, Фоминский А.С., Задача 22233 , 11.08.2021
		Статус = текВыборка.СтатусСообщения;
		ДатаИзменения = текВыборка.ДатаИзменения;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	грОбработкаПакетовИнтеграции.УстановитьСостояниеСообщения(Запись.ИдентификаторСообщения, Статус);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуСеанса()
	Возврат  ТекущаяДатаСеанса();
КонецФункции	


//++ Градум, Фоминский А.С., Задача 22233 , 11.08.2021
&НаСервереБезКонтекста
Функция ОтформатироватьXMLСтроку(СтрокаСообщения)
	
	// Заменяем escape - символы на нормальные
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&gt;&lt;", ">" + Символы.ПС + "<");
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&amp;", "&");
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&lt;", "<");
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&gt;", ">");
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&apos;", "'");
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&quot;", """");
	
	// Излекаем сообщение из Body
	НачНомер        = Найти(СтрокаСообщения, "<Body>");
	XMLбезБоди      = Сред(СтрокаСообщения, НачНомер+6, Найти(СтрокаСообщения, "</Body>")-НачНомер-6);
	
	xdtoДокумент    = сшпОбщегоНазначения.ПолучитьОбъектXDTO(Константы.сшпФорматСообщений.Получить(), XMLбезБоди);
	
	// Создание объекта ЗаписьXML
	ЗаписьXML = Новый ЗаписьXML;
	// Указываем, что запись производится в строку, а не в файл
	ЗаписьXML.УстановитьСтроку();
	// При помощи объекта ФабрикаXDTO записываем данные пакета XDTO в запись XML
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, xdtoДокумент, "ClassData" );
	// Получаем текст записи XML
	ТекстОбъектаXDTO = ЗаписьXML.Закрыть();
	
	СтрокаСообщения = СтрЗаменить(СтрокаСообщения, XMLбезБоди, ТекстОбъектаXDTO);
	
	Возврат СтрокаСообщения;
	
КонецФункции
//-- Градум, Фоминский А.С., Задача 22233 , 11.08.2021

#КонецОбласти
